DiplomD/src/Reports/ОтчетОПроведенииПереаттестации/ОтчетОПроведенииПереаттестации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетОПроведенииПереаттестации</name>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.СписокСтудентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Группы</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗачетнойКнижки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <types>EnumRef.ВидыОценокЗачет</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

DiplomD/src/Catalogs/СписокСтудентов/СписокСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СписокСтудентов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗачетнойКнижки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбразовательнаяПрограмма</name>
    <type>
      <types>CatalogRef.ОбразовательныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БаллВступительныхИспытаний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетнаяКнижка</name>
    <type>
      <types>DocumentRef.ЗачетнаяКнижкаСтудента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОбразования</name>
    <type>
      <types>CatalogRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomD/src/Reports/ОтчетОПроведенииПереаттестации/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	отчет.ТЧ.Очистить();
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	переаттестацияТЧ.Ссылка.Студент КАК Студент,
	               |	переаттестацияТЧ.Ссылка.НомерЗачетнойКнижки КАК НомерЗачетнойКнижки,
	               |	переаттестацияТЧ.Дисциплина КАК Дисциплина,
	               |	переаттестацияТЧ.Оценка КАК Оценка
	               |ИЗ
	               |	Документ.переаттестация.ТЧ КАК переаттестацияТЧ
	               |ГДЕ
	               |	переаттестацияТЧ.Ссылка.Семестр = &Семестр";
	Запрос.УстановитьПараметр("Семестр",Отчет.Семестр); 
	рез = Запрос.Выполнить().Выгрузить(); 
	Для каждого стр из Рез Цикл
		о = Отчет.ТЧ.Добавить(); 
		О.Студент = Стр.Студент; 
		Спр = Справочники.СписокСтудентов.НайтиПоНаименованию(Стр.Студент); 
		О.Группа = Спр.Группа; 
		О.НомерЗачетнойКнижки = Стр.НомерЗачетнойКнижки; 
		О.Дисциплина = Стр.Дисциплина; 
		О.Оценка = Стр.Оценка; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПЕЧАТЬНаСервере()
	табДок = Новый ТабличныйДокумент; 
	
	Макет = Отчеты.ОтчетОПроведенииПереаттестации.ПолучитьМакет("Макет"); 
	
	Шапка = Макет.ПолучитьОбласть("Шапка"); 
	
	Шапка.Параметры.Сем = отчет.Семестр; 
	
	табДок.Вывести(Шапка); 
	
	ШапкаТабл = Макет.ПолучитьОбласть("ШапкаТабл"); 
	
	ТабДок.Вывести(ШапкаТабл); 
	
	Табл = Макет.ПолучитьОбласть("Табл"); 
	
	Для каждого стр из Отчет.ТЧ Цикл
		Табл.Параметры.Студ = стр.Студент; 
		Табл.Параметры.Груп = Стр.Группа; 
		табл.Параметры.Зачетка = Стр.НомерЗачетнойКнижки; 
		Табл.Параметры.Дисц = стр.Дисциплина; 
		Табл.Параметры.Оценка = Стр.Оценка; 
		
		табДок.Вывести(табл); 
		
	КонецЦикла;
	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ПЕЧАТЬ(Команда)
	ТабДок = Новый ТабличныйДокумент; 
	Табдок = ПЕЧАТЬНаСервере(); 
	ТабДок.Показать();
КонецПроцедуры
